Revit 2024 API
ExportLineweightInfo Members
The ExportLineweightInfo type exposes the following members.
Constructors
Name | Description
ExportLineweightInfo()
 Constructs a new default ExportLineweightInfo.
ExportLineweightInfo(String)
 Constructs a new ExportLineweightInfo using the destination line weight name as input.
ExportLineweightInfo(ExportLineweightInfo)
 Constructs a new copy of the input ExportLineweightInfo object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLineweightInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DestinationLineweightName
 The destination lineweight name (the name of the line weight in the exported format)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace